{
  "Projects": [
    {
      "slug": "this",
      "type": "Personal",
      "projectName": "Personal Website ",
      "subHeading": "this.project()",
      "detailed": "This project is an effort to simplify the presentation of my accomplishments, spanning university projects, freelance work, and personal endeavors. The goal is to make it more accessible for recruiters to understand and appreciate my skills and experiences.",
      "description": "Handy for recruiters, a responsive website to showcase my skills and projects. ",
      "roleAndResponsibilities": [
        "Developed a responsive website using Next.js and Tailwind CSS, ensuring adherence to responsive web design guidelines.",
        "Solely responsible for project planning, encompassing the overall structure and organization of the website.",
        "Implemented database functionality for seamless data storage and retrieval.",
        "Developed and integrated APIs to enable efficient communication between different components of the website.",
        "Established routing mechanisms to enhance user navigation within the website.",
        "Designed and incorporated loading screens to optimize the user experience during data fetching.",
        "Collaborated with UX/UI designers to translate design mockups into functional, interactive web interfaces.",
        "Handled the deployment process, ensuring the successful launch of the website to its intended hosting environment."
      ],
      "timeframe": "December 2023 - Present",
      "tags": [
        "Next.js",
        "JSX",
        "Tailwind CSS",
        "Mongo DB",
        "Frontend Development"
      ],
      "skills": [
        "Next.js",
        "Tailwind CSS",
        "Responsive Web Design",
        "Database Management",
        "Frontend Development",
        "Software Development LifeCycle (SDLC)",
        "Visual Studio Code",
        "GitHub"
      ],
      "links": ["https://rohitbajaj.vercel.app/"],
      "media": ["/images/this.jpg"]
    },
    {
      "slug": "gem",
      "type": "Freelance",
      "projectName": "Business Website",
      "subHeading": "Global Education and Migration, Melbourne",
      "detailed": "I helped my family friend to upgrade thier old website to a new and custom vue js website with fast navigation. I also implemented Meta Bussiness suite and calendly service for appointment bookings.",
      "description": "A custom website for an immigration agent based in Melbourne.",
      "roleAndResponsibilities": [
        "Conducted thorough requirements analysis in collaboration with the client to understand their specific needs and preferences for the website.",
        "Utilized Vue.js as the primary frontend framework to develop the website, ensuring a dynamic and responsive user interface.",
        "Employed Tailwind CSS for efficient and maintainable styling, adhering to modern design principles.",
        "Assumed complete ownership of the implementation process, from ideation to deployment, ensuring all aspects of the website align with the client's vision and expectations.",
        "Established routing mechanisms to enhance user navigation within the website.",
        "Collaborated with the client at various stages to gather feedback and incorporate necessary revisions."
      ],
      "timeframe": "November 2023 - December 2023",
      "tags": ["Vue.js", "Requirements analysis", "Tailwind CSS"],
      "skills": [
        "Vue.js",
        "Tailwind CSS",
        "Responsive Web Design",
        "Requirements analysis",
        "Professional Communication",
        "Frontend Development",
        "Visual Studio Code",
        "GitHub"
      ],
      "links": ["https://www.globaleducationandmigration.com/"],
      "media": ["/images/gem2.jpg", "/images/gem.jpg"]
    },
    {
      "slug": "projectEcho",
      "type": "Academic",
      "projectName": "Project Echo",
      "subHeading": "University Capstone Project",
      "detailed": "Last year, I successfully completed my university capstone project, where I began as a Junior Web Developer focusing on the navigation aspects of the software. During this phase, I actively participated in sprints, providing valuable input on design and collaborating with the team to brainstorm interface improvements. My contributions extended to integrating a microphone layer into the map, facilitating the location of deployed microphones across the area. Building on this foundation, I transitioned into roles as a Lead DevOps Engineer and Cloud Engineer, taking charge of the cloud component, optimizing Kubernetes deployments, and establishing efficient CI/CD pipelines. Explore my journey and the skills I've cultivated in web development, design collaboration, and cloud engineering.",

      "description": "An AI/ML based software solution for wild life conservationists to monitor wildlife, especially endangered species located in Wild Otways, Australia. ",
      "roleAndResponsibilities": [
        "Led the cloud component for the university capstone project, overseeing all cloud-related activities on Google Cloud Platform including monthly budgets.",
        "Managed permissions and access controls for various teams, enabling specific resource access.",
        "Led deployment of project components on a Kubernetes cluster, optimizing scalability and ensuring seamless performance.",
        "Collaborated closely with cross-functional teams to ensure alignment of deployment strategies with project objectives and timelines.",
        "Collaborated with cross-functional teams to develop and implement new features for the frontend of web applications.",
        "Worked in an Agile development environment, participating in sprint planning, daily stand-ups, and retrospectives to ensure efficient project progress.",
        "Wrote clean, efficient, and maintainable code in HTML, CSS, and JavaScript, adhering to best practices and coding standards.",
        "Collaborated with UX/UI designers to translate design mockups into functional, interactive web interfaces.",
        "Utilized industry-standard tools such as Visual Studio Code and GitHub for code development, version control, and collaboration."
      ],
      "timeframe": "March 2023 - October 2023",
      "tags": [
        "National AIIA iAwards 2023",
        "HTML",
        "CSS",
        "Node.js",
        "JavaScript",
        "Docker",
        "Kubernetes",
        "GCP"
      ],
      "skills": [
        "HTML5",
        "Cascading Style Sheets (CSS)",
        "JavaScript",
        "Frontend Frameworks: Vue.js, Express.js",
        "Kubernetes Deployments",
        "Continuous Integration/Continuous Deployment (CI/CD) Pipelines",
        "Identity and Access Management (IAM)",
        "Configuration Management",
        "Google Cloud Platform (GCP)",
        "Bash scripting",
        "Python scripting",
        "Agile Development",
        "Sprint Planning",
        "Software Development LifeCycle (SDLC)",
        "Cross-functional Collaboration",
        "Visual Studio Code",
        "GitHub"
      ],
      "links": ["https://github.com/DataBytes-Organisation/Project-Echo"],
      "media": ["/images/echo1.jpg", "/images/echo2.jpg", "/images/echo3.jpg"]
    }
  ]
}
